src/Catalogs/НормыРасходов/НормыРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НормыРасходов</name>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.Материалы</owners>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЭлемента</name>
    <type>
      <types>EnumRef.ВидыЭлементовНормРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Элемент</name>
    <type>
      <types>CatalogRef.ТехОснастка</types>
      <types>CatalogRef.Документация</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ТехОперации</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Позиция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корневой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/АналогиНормРасходов/АналогиНормРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АналогиНормРасходов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Норма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.НормыРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналогНормыРасходов</name>
    <type>
      <types>CatalogRef.АналогиНормРасходов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Материалы/Материалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Материалы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PartNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМатериала</name>
    <type>
      <types>CatalogRef.ВидыМатериалов</types>
    </type>
  </attributes>
  <attributes>
    <name>Возвратный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаВариабельности</name>
    <type>
      <types>EnumRef.ГруппыВариабельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПоЗакупкам</name>
    <type>
      <types>EnumRef.ГруппыПоЗакупкам</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПересмотра</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументИВХ</name>
    <type>
      <types>CatalogRef.Документация</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаХранения</name>
    <type>
      <types>EnumRef.ЗоныХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>CatalogRef.Документация</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторВнесения</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалПроверки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Каталогизатор</name>
    <type>
      <types>CatalogRef.Каталогизатор</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКЗаказу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьГрупповойУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьЗаготовки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьИндивидуальнойУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Критичный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйЗапас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПоЗакупкам</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>МинОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеSMD</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормативРабочейЯчейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеМодели</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПиковыеПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолнНаименование</name>
    <comment>Полное наименование, краткие характеристики</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакНеделимойУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВнесения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Производители</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрослеживаемыйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделПоЕСКД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтраховойЗапас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНормированияЗакупок</name>
    <type>
      <types>EnumRef.ТипыНормированияЗакупок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПоставки</name>
    <type>
      <types>EnumRef.ТипыПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРиска</name>
    <type>
      <types>EnumRef.ТипыРиска</types>
    </type>
  </attributes>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяВходнойКонтроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Фасовка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаНачГода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаПлановая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаФактическаяНачГода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Аналог</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтационарныеПитатели</name>
    <attributes>
      <name>Линейка</name>
      <type>
        <types>CatalogRef.Линейки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Замены</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Материалы</types>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поставщики</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КоммерческиеПредложения</name>
    <attributes>
      <name>КП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБыло</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСтало</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/НормыРасходов/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Запрос = Новый Запрос;

	Если (ТипЗнч(Объект.Элемент) = Тип("СправочникСсылка.Материалы"))или
		 (ТипЗнч(Объект.Элемент) = Тип("СправочникСсылка.Номенклатура"))Тогда
	Элементы.ЕдИзмЭлемента.Заголовок = Объект.Элемент.ОсновнаяЕдиницаИзмерения.Наименование;
	КонецЕсли;
		Если Параметры.Свойство("Владелец") Тогда	
		Объект.Владелец = Параметры.Владелец;
		КонецЕсли;
НаДату = ТекущаяДата(); 
Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НормыРасходов.Период КАК Период,
	|	НормыРасходов.Норма КАК Норма,
	|	НормыРасходов.Элемент КАК Элемент
	|ИЗ
	|	РегистрСведений.НормыРасходов КАК НормыРасходов
	|ГДЕ
	|	НормыРасходов.НормаРасходов = &НормаРасходов
	|	И НормыРасходов.Владелец = &Владелец
	|
	|УПОРЯДОЧИТЬ ПО
	|	НормыРасходов.Период УБЫВ";
Запрос.УстановитьПараметр("НормаРасходов", Объект.Ссылка);
Запрос.УстановитьПараметр("Владелец", Объект.Владелец);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
	ЭлементСтарый = ВыборкаДетальныеЗаписи.Элемент;
	Норма = ВыборкаДетальныеЗаписи.Норма;
	КонецЦикла;
КонецПроцедуры
       
&НаКлиенте
Процедура ПриОткрытии(Отказ)
РегистрНормРасходов.Параметры.УстановитьЗначениеПараметра("НормаРасходов",Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если НаДату = НачалоДня(ТекущаяДата()) Тогда
	ДатаИзм = ТекущаяДата();
	Иначе
	ДатаИзм = НаДату;	
	КонецЕсли; 
		Если Объект.Элемент <> ЭлементСтарый Тогда
		РНР = РегистрыСведений.НормыРасходов.СоздатьНаборЗаписей();
		РНР.Отбор.НормаРасходов.Установить(Объект.Ссылка);
		РНР.Прочитать();
			Для Каждого Запись Из РНР Цикл
			Запись.Элемент = Объект.Элемент;
			КонецЦикла;	      
		РНР.Записать(Истина);
		КонецЕсли; 
Нормы = РегистрыСведений.НормыРасходов.ПолучитьПоследнее(ДатаИзм,Новый Структура("НормаРасходов",Объект.Ссылка));
	Если Норма <> Нормы.Норма Тогда
	РНР = РегистрыСведений.НормыРасходов.СоздатьМенеджерЗаписи();
	РНР.Период = ДатаИзм;
	РНР.Владелец = Объект.Владелец;
	РНР.Элемент = Объект.Элемент;
	РНР.НормаРасходов = Объект.Ссылка;
	РНР.Норма = Норма;
	РНР.Записать(); 
	КонецЕсли;     
Элементы.РегистрНормРасходов.Обновить();
	Если Норма = 0 Тогда
	ТаблицаАналогов = ОбщегоНазначенияПовтИсп.ПолучитьАналогиНормРасходов(Объект.Ссылка,ДатаИзм,Истина);
		Для каждого ТЧ Из ТаблицаАналогов Цикл
		РАНР = РегистрыСведений.АналогиНормРасходов.СоздатьМенеджерЗаписи();
		РАНР.Период = ДатаИзм;
		РАНР.Владелец = ТЧ.Ссылка.Владелец;
		РАНР.АналогНормыРасходов = ТЧ.Ссылка;
		РАНР.Норма = 0;
		РАНР.Записать();	
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
             
&НаКлиенте
Процедура ПриЗакрытии()
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	ОповеститьОВыборе("Выбор");
	Иначе
	ОповеститьОВыборе(Неопределено);
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПолучитьВидДокумента(ВыбЭлемент)
Возврат(Строка(ВыбЭлемент.ВидДокумента));
КонецФункции

&НаСервере
Функция ПолучитьОсновнуюЕдиницуИзмерения(ВыбЭлемент)
Возврат(ВыбЭлемент.ОсновнаяЕдиницаИзмерения.Наименование);
КонецФункции

&НаКлиенте
Процедура ЭлементНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
П = Новый Структура("ТекущаяСтрока",Объект.Элемент);
	Если Элементы.ВидЭлемента.ТекстРедактирования = "Материал" Тогда
	Результат = ОткрытьФормуМодально("Справочник.Материалы.ФормаВыбора",П);
		Если Результат = Неопределено Тогда
		Возврат;
		КонецЕсли;  
	Объект.Наименование = "Материал, "+Результат;
	Элементы.ЕдИзмЭлемента.Заголовок = ПолучитьОсновнуюЕдиницуИзмерения(Результат);
	ИначеЕсли Элементы.ВидЭлемента.ТекстРедактирования = "Материал вспомогательный" Тогда
	Результат = ОткрытьФормуМодально("Справочник.Материалы.ФормаВыбора",П);
		Если Результат = Неопределено Тогда
		Возврат;
		КонецЕсли;  
	Объект.Наименование = "Материал вспомогательный, "+Результат;
	Элементы.ЕдИзмЭлемента.Заголовок = ПолучитьОсновнуюЕдиницуИзмерения(Результат);
	ИначеЕсли Элементы.ВидЭлемента.ТекстРедактирования = "Тех. операция" Тогда	
	Результат = ОткрытьФормуМодально("Справочник.ТехОперации.Форма.ФормаВыбораЭлемента",П); 
		Если Результат = Неопределено Тогда
		Возврат;
		КонецЕсли;
	Объект.Наименование = "Тех. операция, "+Результат;
	ИначеЕсли Элементы.ВидЭлемента.ТекстРедактирования = "Тех. оснастка" Тогда	
	Результат = ОткрытьФормуМодально("Справочник.ТехОснастка.ФормаВыбора",П); 
		Если Результат = Неопределено Тогда
		Возврат;
		КонецЕсли;
	Объект.Наименование = "Тех. оснастка, "+Результат;	
	ИначеЕсли (Элементы.ВидЭлемента.ТекстРедактирования = "Документ")или
			  (Элементы.ВидЭлемента.ТекстРедактирования = "Программа")Тогда	
	Результат = ОткрытьФормуМодально("Справочник.Документация.ФормаВыбора",П); 
		Если Результат = Неопределено Тогда
		Возврат;
		КонецЕсли;
	Объект.Наименование = ПолучитьВидДокумента(Результат)+", "+Результат;	
	Иначе
	Результат = ОткрытьФормуМодально("Справочник.Номенклатура.ФормаВыбора",П); 
		Если Результат = Неопределено Тогда
		Возврат;
		КонецЕсли;
	Объект.Наименование = Строка(Объект.ВидЭлемента)+", "+Результат;
	Элементы.ЕдИзмЭлемента.Заголовок = ПолучитьОсновнуюЕдиницуИзмерения(Результат);			
	КонецЕсли;	
Объект.Элемент = Результат;	
КонецПроцедуры

&НаСервере
Процедура ВидЭлементаПриИзмененииНаСервере()
	Если Объект.Элемент <> Неопределено Тогда
		Если ТипЗнч(Объект.ВидЭлемента) = Тип("СправочникСсылка.Документация") Тогда
		Объект.Наименование = Строка(Объект.Элемент.ВидДокумента)+", "+Объект.Элемент.Наименование;
		Иначе
		Объект.Наименование = Строка(Объект.ВидЭлемента)+", "+Объект.Элемент.Наименование;
		КонецЕсли; 	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ВидЭлементаПриИзменении(Элемент)
ВидЭлементаПриИзмененииНаСервере();
КонецПроцедуры
